//=============================================
//
//ゲームマネージャーの処理[gamemanager.cpp]
//Auther Yuuto Shimadu
//
//=============================================

//ヘッダーのインクルード
#include "gamemanager.h"

//=====================================================
//コンストラクタ
//=====================================================
CGameManager::CGameManager() :
	m_pPlayer(nullptr)	//プレイヤーのポインタ
{

}

//=====================================================
//デストラクタ
//=====================================================
CGameManager::~CGameManager()
{

}